#!/usr/bin/python3
# -*- coding: utf-8 -*-
################################################################################
#    DChars Copyright (C) 2012 Suizokukan
#    Contact: suizokukan _A.T._ orange dot fr
#
#    This file is part of DChars.
#    DChars is free software: you can redistribute it and/or modify
#    it under the terms of the GNU General Public License as published by
#    the Free Software Foundation, either version 3 of the License, or
#    (at your option) any later version.
#
#    DChars is distributed in the hope that it will be useful,
#    but WITHOUT ANY WARRANTY; without even the implied warranty of
#    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#    GNU General Public License for more details.
#
#    You should have received a copy of the GNU General Public License
#    along with DChars.  If not, see <http://www.gnu.org/licenses/>.
################################################################################
"""
    ❏DChars❏ : dchars/languages/jpn/symbols.py
"""

# problem with Pylint :
# pylint: disable=E0611
# many errors like "No name 'extensions' in module 'dchars'"
from dchars.utilities.name2symbols import Name2Symbols

#...............................................................................
# symbols used by the Ancient Greek :
#
# CAVEAT ! If you modify these dictionaries, don't forget to modify their
# corresponding transliteration's dictionaries !
#
#...............................................................................
SYMB_HIRAGANA =
    {
      'あ'        : ('あ',),
      'い'        : ('い',),
      'う'        : ('う',),
      'え'        : ('え',),
      'お'        : ('お',),
      'か'        : ('か',),
      'き'        : ('き',),
      'く'        : ('く',),
      'け'        : ('け',),
      'こ'        : ('こ',),
      'さ'        : ('さ',),
      'し'        : ('し',),
      'す'        : ('す',),
      'せ'        : ('せ',),
      'そ'        : ('そ',),
      'た'        : ('た',),
      'ち'        : ('ち',),
      'つ'        : ('つ',),
      'て'        : ('て',),
      'と'        : ('と',),
      'な'        : ('な',),
      'に'        : ('に',),
      'ぬ'        : ('ぬ',),
      'ね'        : ('ね',),
      'の'        : ('の',),
      'は'        : ('は',),
      'ひ'        : ('ひ',),
      'ふ'        : ('ふ',),
      'へ'        : ('へ',),
      'ほ'        : ('ほ',),
      'ま'        : ('ま',),
      'み'        : ('み',),
      'む'        : ('む',),
      'め'        : ('め',),
      'も'        : ('も',),
      'や'        : ('や',),
      'ゆ'        : ('ゆ',),
      'よ'        : ('よ',),
      'ら'        : ('ら',),
      'り'        : ('り',),
      'る'        : ('る',),
      'れ'        : ('れ',),
      'ろ'        : ('ろ',),
      'わ'        : ('わ',),
      'ゐ'        : ('ゐ',),
      'ゑ'        : ('ゑ',),
      'を'        : ('を',),
      'ん'        : ('ん',),
    }

SYMB_SMALL_HIRAGANA =
    {
      'ぁ'        : ('ぁ',),
      'ぃ'        : ('ぃ',),
      'ぅ'        : ('ぅ',),
      'ぇ'        : ('ぇ',),
      'ぉ'        : ('ぉ',),

      # small ka :
      'ゕ'        : ('ゕ',),
      # small ke :
      'ゖ'        : ('ゖ',),

      'っ'        : ('っ',),

      'ゃ'        : ('ゃ',),
      'ゅ'        : ('ゅ',),
      'ょ'        : ('ょ',),

      'ゎ'        : ('ゎ',),
    }

SYMB_KATAKANA =
    {
      'ア'        : ('ア',),
      'イ'        : ('イ',),
      'ウ'        : ('ウ',),
      'エ'        : ('エ',),
      'オ'        : ('オ',),
      'カ'        : ('カ',),
      'キ'        : ('キ',),
      'ク'        : ('ク',),
      'ケ'        : ('ケ',),
      'コ'        : ('コ',),
      'サ'        : ('サ',),
      'シ'        : ('シ',),
      'ス'        : ('ス',),
      'セ'        : ('セ',),
      'ソ'        : ('ソ',),
      'タ'        : ('タ',),
      'チ'        : ('チ',),
      'ツ'        : ('ツ',),
      'テ'        : ('テ',),
      'ト'        : ('ト',),
      'ナ'        : ('ナ',),
      'ニ'        : ('ニ',),
      'ヌ'        : ('ヌ',),
      'ネ'        : ('ネ',),
      'ノ'        : ('ノ',),
      'ハ'        : ('ハ',),
      'ヒ'        : ('ヒ',),
      'フ'        : ('フ',),
      'ヘ'        : ('ヘ',),
      'ホ'        : ('ホ',),
      'マ'        : ('マ',),
      'ミ'        : ('ミ',),
      'ム'        : ('ム',),
      'メ'        : ('メ',),
      'モ'        : ('モ',),
      'ヤ'        : ('ヤ',),
      'ユ'        : ('ユ',),
      'ヨ'        : ('ヨ',),
      'ラ'        : ('ラ',),
      'リ'        : ('リ',),
      'ル'        : ('ル',),
      'レ'        : ('レ',),
      'ロ'        : ('ロ',),
      'ワ'        : ('ワ',),
      'ヰ'        : ('ヰ',),
      'ヱ'        : ('ヱ',),
      'ヲ'        : ('ヲ',),
      'ン'        : ('ン',),
    }

SYMB_SMALL_KATAKANA =
    {
      'ァ'        : ('ァ',),
      'ィ'        : ('ィ',),
      'ゥ'        : ('ゥ',),
      'ェ'        : ('ェ',),
      'ォ'        : ('ォ',),

      # small ka :
      'ヵ'        : ('ヵ',),
      # small ke :
      'ヶ'        : ('ヶ',),

      'ッ'        : ('ッ',),

      'ャ'        : ('ャ',),
      'ュ'        : ('ュ',),
      'ョ'        : ('ョ',),

      'ヮ'        : ('ヮ',),
    }

# http://en.wikipedia.org/wiki/List_of_j%C5%8Dy%C5%8D_kanji
SYMB_KANJI =
    {
      # jōyō kanji #1 -> #10
      '亜'        : ('亜', '亞'),
      '哀'        : ('哀',),
      '挨'        : ('挨',),
      '愛'        : ('愛',),
      '曖'        : ('曖',),
      '悪'        : ('悪', '惡'),
      '握'        : ('握',),
      '圧'        : ('圧', '壓'),
      '扱'        : ('扱',),
      '宛'        : ('宛',),

      # jōyō kanji #11 -> #20
      '嵐'        : ('嵐',),
      '安'        : ('安',),
      '案'        : ('案',),
      '暗'        : ('暗',),
      '以'        : ('以',),
      '衣'        : ('衣',),
      '位'        : ('位',),
      '囲'        : ('囲',),
      '医'        : ('医',),
      '依'        : ('依',),

      # jōyō kanji #21 -> #30
      '委'        : ('委',),
      '威'        : ('威',),
      '為'        : ('為', '爲'),
      '畏'        : ('畏',),
      '胃'        : ('胃',),
      '尉'        : ('尉',),
      '異'        : ('異',),
      '移'        : ('移',),
      '萎'        : ('萎',),
      '偉'        : ('偉',),

      # jōyō kanji #31 -> #40
      '椅'        : ('椅',),
      '彙 '        : ('彙 ',),
      '意'        : ('意',),
      '違'        : ('違',),
      '維'        : ('維',),
      '慰'        : ('慰',),
      '遺'        : ('遺',),
      '緯'        : ('緯',),
      '域'        : ('域',),
      '育'        : ('育',),

      # jōyō kanji #41 -> #50
      '一'        : ('一',),
      '壱'        : ('壱', '壹'),
      '逸'        : ('逸', '逸'),
      '茨'        : ('茨',),
      '芋'        : ('芋',),
      '引'        : ('引',),
      '印'        : ('印',),
      '因'        : ('因',),
      '咽'        : ('咽',),
      '姻'        : ('姻',),

      # jōyō kanji #51 -> #60
      '員'        : ('員',),
      '院'        : ('院',),
      '淫'        : ('淫',),
      '陰'        : ('陰',),
      '飲'        : ('飲',),
      '隠'        : ('隠', '隱'),
      '韻'        : ('韻',),
      '右'        : ('右',),
      '宇'        : ('宇',),
      '羽'        : ('羽',),
    }
    
# http://ja.wikipedia.org/wiki/%E6%8B%AC%E5%BC%A7
SYMB_PUNCTUATION = Name2Symbols(
    {"("         : ('(',),
     ")"        : (')',),
     "（"         : ('（',),
     "）"         : ('）',),
     "⎛"         : ('⎛',),
     "⎜"         : ('⎜',),
     "⎝"         : ('⎝',),
     "⎞"         : ('⎞',),
     "⎟"         : ('⎟',),
     "⎠"         : ('⎠',),
     "︵"         : ('︵',),
     "︶"         : ('︶',),
     "﴾"         : ('﴾',),
     "﴿"         : ('﴿',),
     "﹙"         : ('﹙',),
     "﹚"         : ('﹚',),
     "❨"         : ('❨',),
     "❩"         : ('❩',),
     "❪"         : ('❪',),
     "❫"         : ('❫',),
     "⁽"         : ('⁽',),
     "⁾"         : ('⁾',),
     "₍"         : ('₍',),
     "₎"         : ('₎',),
     
     "⦅"         : ('⦅',),
     "⦆"         : ('⦆',),
     "｟"         : ('｟',),
     "｠"         : ('｠',),
     "⸨"         : ('⸨',),
     "⸩"         : ('⸩',),
     
     "「"         : ('「',),
     "」"         : ('」',),
     "｢"         : ('｢',),
     "｣"         : ('｣',),
     "﹁"         : ('﹁',),
     "﹂"         : ('﹂',),

     "『"         : ('『',),
     "』"         : ('』',),
     "﹃"         : ('﹃',),
     "﹄"         : ('﹄',),

     "["         : ('[',),
     "]"         : (']',),
     "［"         : ('［',),
     "］"         : ('］',),
     "⎡"         : ('⎡',),
     "⎢"         : ('⎢',),
     "⎣"         : ('⎣',),
     "⎤"         : ('⎤',),
     "⎥"         : ('⎥',),
     "⎦"         : ('⎦',),
     "﹇"         : ('﹇',),
     "﹈"         : ('﹈',),

     "〚"         : ('〚',),
     "〛"         : ('〛',),
     "⟦"         : ('⟦',),
     "⟧"         : ('⟧',),

     "{"         : ('{',),
     "}"         : ('}',),
     "｛"         : ('｛',),
     "｝"         : ('｝',),
     "⎧"         : ('⎧',),
     "⎨"         : ('⎨',),
     "⎩"         : ('⎩',),
     "⎪"         : ('⎪',),
     "⎫"         : ('⎫',),
     "⎬"         : ('⎬',),
     "⎭"         : ('⎭',),
     "⎰"         : ('⎰',),
     "⎱"         : ('⎱',),
     "︷"         : ('︷',),
     "︸"         : ('︸',),
     "﹛"         : ('﹛',),
     "﹜"         : ('﹜',),
     "❴"         : ('❴',),
     "❵"         : ('❵',),

     "〔"         : ('〔',),
     "〕"         : ('〕',),
     "❲"         : ('❲',),
     "❳"         : ('❳',),
     "⟮"         : ('⟮',),
     "⟯"         : ('⟯',),
     "︹"         : ('︹',),
     "︺"         : ('︺',),

     "〘"         : ('〘',),
     "〙"         : ('〙',),
     "⟬"         : ('⟬',),
     "⟭"         : ('⟭',),

     "〈"         : ('〈',),
     "〉"         : ('〉',),
     "〈"         : ('〈',),
     "〉"         : ('〉',),
     "❬"         : ('❬',),
     "❭"         : ('❭',),
     "❰"         : ('❰',),
     "❱"         : ('❱',),
     "‹"         : ('‹',),
     "›"         : ('›',),
     "⧼"         : ('⧼',),
     "⧽"         : ('⧽',),
     "⟨"         : ('⟨',),
     "⟩"         : ('⟩',),
     "︿"         : ('︿',),
     "﹀"         : ('﹀',),

     "《"         : ('《',),
     "》"         : ('》',),
     "⟪"         : ('⟪',),
     "⟫"         : ('⟫',),
     "︽"         : ('︽',),
     "︾"         : ('︾',),

     "<"         : ('<',),
     ">"         : ('>',),

     "＜"         : ('＜',),
     "＞"         : ('＞',),
     "≪"         : ('≪',),
     "≫"         : ('≫',),

     "«"         : ('«',),
     "»"         : ('»',),
     "‹"         : ('‹',),
     "›"         : ('›',),

     "【"         : ('【',),
     "】"         : ('】',),
     "︻"         : ('︻',),
     "︼"         : ('︼',),

     "〖"         : ('〖',),
     "〗"         : ('〗',),
     "︗"         : ('︗',),
     "︘"         : ('︘',),

     # http://ja.wikipedia.org/wiki/%E3%83%AA%E3%83%BC%E3%83%80%E3%83%BC_%28%E8%A8%98%E5%8F%B7%29
     "…"         : ('…',),
     "‥"         : ('‥',),
     "⋯"         : ('⋯',),
     "︙"         : ('︙',),
     "︰"         : ('︰',),
     "⁝"         : ('⁝',),
     "⁚"         : ('⁚',),

     # http://ja.wikipedia.org/wiki/%E8%AA%AD%E7%82%B9
     "、"         : ('、',),
     "､"         : ('､',),

     # http://ja.wikipedia.org/wiki/%E5%8F%A5%E7%82%B9
     "。"         : ('。',),
     "｡"         : ('｡',),
     "︒"         : ('︒',),

     # http://ja.wikipedia.org/wiki/%E4%B8%AD%E9%BB%92
     "·"         : ('·',),
     "·"         : ('·',),
     "•"         : ('•',),
     "∙"         : ('∙',),
     "⋅"         : ('⋅',),
     "・"         : ('・',),
     "･"         : ('･',),

     # http://ja.wikipedia.org/wiki/%E5%BA%B5%E7%82%B9
     "〽"         : ('〽',),

     # http://ja.wikipedia.org/wiki/%E6%B3%A2%E3%83%80%E3%83%83%E3%82%B7%E3%83%A5
     "〜"         : ('〜',),

     # http://ja.wikipedia.org/wiki/%E6%84%9F%E5%98%86%E7%AC%A6
     "!"         : ('!',),
     "¡"         : ('¡',),
     "ǃ"         : ('ǃ',),
     "‼"         : ('‼',),
     "！"         : ('！',),

     # http://ja.wikipedia.org/wiki/%E7%96%91%E5%95%8F%E7%AC%A6
     "?"         : ('?',),
     "？"         : ('？',),
     "⁇"         : ('⁇',),
     "¿"         : ('¿',),

     '\n'       : ('\n',),
     '\r'       : ('\r',),
     '\t'       : ('\t',),
    })

SYMB_DIACRITICS = Name2Symbols(
    {"dakuten"          : ( chr(0x3099),),      # が 
     "handakuten"       : ( chr(0x309A1,),      # ぱ̍
     })

# we define these constants in order to avoir multiple calls to SYMB_DIACRITICS.get_default_symbol :
DEFAULTSYMB__DAKUTEN = SYMB_DIACRITICS.get_default_symbol('dakuten')
DEFAULTSYMB__HANDAKUTEN = SYMB_DIACRITICS.get_default_symbol('handakuten')
